changed font to verdana, added logo on top right, updated nav, switched to mermaid and html diagrams
